frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/twis.h
/**
 * \file
 *
 * \brief Component description for TWIS
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_TWIS_COMPONENT_
#define _SAM4L_TWIS_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TWIS */
/* ========================================================================== */
/** \addtogroup SAM4L_TWIS Two-wire Slave Interface */
/*@{*/

#define TWIS_I7537
#define REV_TWIS                    0x140

/* -------- TWIS_CR : (TWIS Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEN:1;            /*!< bit:      0  Slave Enable                       */
    uint32_t SMEN:1;           /*!< bit:      1  SMBus Mode Enable                  */
    uint32_t SMATCH:1;         /*!< bit:      2  Slave Address Match                */
    uint32_t GCMATCH:1;        /*!< bit:      3  General Call Address Match         */
    uint32_t STREN:1;          /*!< bit:      4  Clock Stretch Enable               */
    uint32_t :2;               /*!< bit:  5.. 6  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:      7  Software Reset                     */
    uint32_t SMBALERT:1;       /*!< bit:      8  SMBus Alert                        */
    uint32_t SMDA:1;           /*!< bit:      9  SMBus Default Address              */
    uint32_t SMHH:1;           /*!< bit:     10  SMBus Host Header                  */
    uint32_t PECEN:1;          /*!< bit:     11  Packet Error Checking Enable       */
    uint32_t ACK:1;            /*!< bit:     12  Slave Receiver Data Phase ACK Value */
    uint32_t CUP:1;            /*!< bit:     13  NBYTES Count Up                    */
    uint32_t SOAM:1;           /*!< bit:     14  Stretch Clock on Address Match     */
    uint32_t SODR:1;           /*!< bit:     15  Stretch Clock on Data Byte Reception */
    uint32_t ADR:10;           /*!< bit: 16..25  Slave Address                      */
    uint32_t TENBIT:1;         /*!< bit:     26  Ten Bit Address Match              */
    uint32_t BRIDGE:1;         /*!< bit:     27  Bridge Control Enable              */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_CR_OFFSET              0x00         /**< \brief (TWIS_CR offset) Control Register */
#define TWIS_CR_RESETVALUE          _U(0x00000000); /**< \brief (TWIS_CR reset_value) Control Register */

#define TWIS_CR_SEN_Pos             0            /**< \brief (TWIS_CR) Slave Enable */
#define TWIS_CR_SEN                 (_U(0x1) << TWIS_CR_SEN_Pos)
#define TWIS_CR_SMEN_Pos            1            /**< \brief (TWIS_CR) SMBus Mode Enable */
#define TWIS_CR_SMEN                (_U(0x1) << TWIS_CR_SMEN_Pos)
#define TWIS_CR_SMATCH_Pos          2            /**< \brief (TWIS_CR) Slave Address Match */
#define TWIS_CR_SMATCH              (_U(0x1) << TWIS_CR_SMATCH_Pos)
#define TWIS_CR_GCMATCH_Pos         3            /**< \brief (TWIS_CR) General Call Address Match */
#define TWIS_CR_GCMATCH             (_U(0x1) << TWIS_CR_GCMATCH_Pos)
#define TWIS_CR_STREN_Pos           4            /**< \brief (TWIS_CR) Clock Stretch Enable */
#define TWIS_CR_STREN               (_U(0x1) << TWIS_CR_STREN_Pos)
#define TWIS_CR_SWRST_Pos           7            /**< \brief (TWIS_CR) Software Reset */
#define TWIS_CR_SWRST               (_U(0x1) << TWIS_CR_SWRST_Pos)
#define TWIS_CR_SMBALERT_Pos        8            /**< \brief (TWIS_CR) SMBus Alert */
#define TWIS_CR_SMBALERT            (_U(0x1) << TWIS_CR_SMBALERT_Pos)
#define TWIS_CR_SMDA_Pos            9            /**< \brief (TWIS_CR) SMBus Default Address */
#define TWIS_CR_SMDA                (_U(0x1) << TWIS_CR_SMDA_Pos)
#define TWIS_CR_SMHH_Pos            10           /**< \brief (TWIS_CR) SMBus Host Header */
#define TWIS_CR_SMHH                (_U(0x1) << TWIS_CR_SMHH_Pos)
#define TWIS_CR_PECEN_Pos           11           /**< \brief (TWIS_CR) Packet Error Checking Enable */
#define TWIS_CR_PECEN               (_U(0x1) << TWIS_CR_PECEN_Pos)
#define TWIS_CR_ACK_Pos             12           /**< \brief (TWIS_CR) Slave Receiver Data Phase ACK Value */
#define TWIS_CR_ACK                 (_U(0x1) << TWIS_CR_ACK_Pos)
#define TWIS_CR_CUP_Pos             13           /**< \brief (TWIS_CR) NBYTES Count Up */
#define TWIS_CR_CUP                 (_U(0x1) << TWIS_CR_CUP_Pos)
#define TWIS_CR_SOAM_Pos            14           /**< \brief (TWIS_CR) Stretch Clock on Address Match */
#define TWIS_CR_SOAM                (_U(0x1) << TWIS_CR_SOAM_Pos)
#define TWIS_CR_SODR_Pos            15           /**< \brief (TWIS_CR) Stretch Clock on Data Byte Reception */
#define TWIS_CR_SODR                (_U(0x1) << TWIS_CR_SODR_Pos)
#define TWIS_CR_ADR_Pos             16           /**< \brief (TWIS_CR) Slave Address */
#define TWIS_CR_ADR_Msk             (_U(0x3FF) << TWIS_CR_ADR_Pos)
#define TWIS_CR_ADR(value)          (TWIS_CR_ADR_Msk & ((value) << TWIS_CR_ADR_Pos))
#define TWIS_CR_TENBIT_Pos          26           /**< \brief (TWIS_CR) Ten Bit Address Match */
#define TWIS_CR_TENBIT              (_U(0x1) << TWIS_CR_TENBIT_Pos)
#define TWIS_CR_BRIDGE_Pos          27           /**< \brief (TWIS_CR) Bridge Control Enable */
#define TWIS_CR_BRIDGE              (_U(0x1) << TWIS_CR_BRIDGE_Pos)
#define TWIS_CR_MASK                _U(0x0FFFFF9F) /**< \brief (TWIS_CR) MASK Register */

/* -------- TWIS_NBYTES : (TWIS Offset: 0x04) (R/W 32) NBYTES Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NBYTES:8;         /*!< bit:  0.. 7  Number of Bytes to Transfer        */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_NBYTES_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_NBYTES_OFFSET          0x04         /**< \brief (TWIS_NBYTES offset) NBYTES Register */
#define TWIS_NBYTES_RESETVALUE      _U(0x00000000); /**< \brief (TWIS_NBYTES reset_value) NBYTES Register */

#define TWIS_NBYTES_NBYTES_Pos      0            /**< \brief (TWIS_NBYTES) Number of Bytes to Transfer */
#define TWIS_NBYTES_NBYTES_Msk      (_U(0xFF) << TWIS_NBYTES_NBYTES_Pos)
#define TWIS_NBYTES_NBYTES(value)   (TWIS_NBYTES_NBYTES_Msk & ((value) << TWIS_NBYTES_NBYTES_Pos))
#define TWIS_NBYTES_MASK            _U(0x000000FF) /**< \brief (TWIS_NBYTES) MASK Register */

/* -------- TWIS_TR : (TWIS Offset: 0x08) (R/W 32) Timing Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TLOWS:8;          /*!< bit:  0.. 7  SMBus Tlow:sext Cycles             */
    uint32_t TTOUT:8;          /*!< bit:  8..15  SMBus Ttimeout Cycles              */
    uint32_t SUDAT:8;          /*!< bit: 16..23  Data Setup Cycles                  */
    uint32_t :4;               /*!< bit: 24..27  Reserved                           */
    uint32_t EXP:4;            /*!< bit: 28..31  Clock Prescaler                    */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_TR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

